20240504T154953--kdoc-163-セグメンテーションとページングのユースケースを考える__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T18:41:47Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 163: セグメンテーションとページングのユースケースを考える</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 163: セグメンテーションとページングのユースケースを考える</h1>
<div id="outline-container-org96d579d" class="outline-2">
<h2 id="org96d579d"><a href="#org96d579d">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org96d579d">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-09 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-09 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd8ae098" class="outline-2">
<h2 id="orgd8ae098"><a href="#orgd8ae098">最近はページングを使うことが多い</a></h2>
<div class="outline-text-2" id="text-orgd8ae098">
<p>
メモリのアドレス変換に2つの方式があることを学んだ。どう使い分けるのだろう、と疑問を持った。
</p>

<p>
調べてみて、使い分けというよりは、歴史的な2つの方式だと理解した。セグメンテーションはあまり使われなくなり、今はページングを使うことが多い。
</p>

<p>
セグメンテーションは連続化したメモリが必要で、解放されているメモリが小さな塊では使えない。そのためデフラグメンテーションという処理で移動が必要。デフラグメンテーションは大量のコピーが必要なので遅い。断片化しすぎる前に定期的に実行する必要がある。
</p>

<p>
x86の64bitモードではセグメンテーションをサポートしていない。ほとんどのシステムでセグメンテーションが用いられなくなった理由の1つに断片化の問題がある。ページングによって断片化の問題を回避できる。
</p>
</div>
</div>
<div id="outline-container-org313831b" class="outline-2">
<h2 id="org313831b"><a href="#org313831b">参考</a></h2>
<div class="outline-text-2" id="text-org313831b">
<ul class="org-ul">
<li><a href="https://os.phil-opp.com/ja/paging-introduction/">ページング入門 | Writing an OS in Rust</a></li>
</ul>
</div>
</div>
<div id="outline-container-org503c8cb" class="outline-2">
<h2 id="org503c8cb"><a href="#org503c8cb">関連</a></h2>
<div class="outline-text-2" id="text-org503c8cb">
<ul class="org-ul">
<li><a href="20240427T113714--kdoc-140-『自作エミュレータで学ぶx86アーキテクチャ』__book.html#ID-20240427T113714">KDOC 140: 『自作エミュレータで学ぶx86アーキテクチャ』</a>。本を読んで考えたこと</li>
<li><a href="20240504T154649--kdoc-162-セグメンテーションとページングの違いを見る__wiki.html#ID-20240504T154649">KDOC 162: セグメンテーションとページングの違いを見る</a>。まず違いを調べた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
